{
    "casos_clinicos": [
        {
            "id": 1,
            "titulo": "Caso Clínico: Paciente con Hipertensión",
            "descripcion": "María, 65 años, acude a la farmacia con una receta médica para tratar su hipertensión arterial. Presenta presión arterial de 160/95 mmHg y tiene antecedentes de diabetes tipo 2.",
            "preguntas": [
                {
                    "id": 1,
                    "pregunta": "¿Cuál de los siguientes medicamentos NO es un antihipertensivo?",
                    "opciones": [
                        "A) Losartán",
                        "B) Amlodipino", 
                        "C) Paracetamol",
                        "D) Enalapril"
                    ],
                    "respuesta_correcta": 2,
                    "explicacion": "El paracetamol es un analgésico y antipirético, no un antihipertensivo. Losartán, Amlodipino y Enalapril son medicamentos antihipertensivos."
                },
                {
                    "id": 2,
                    "pregunta": "¿Qué precaución especial debe tener María al tomar antihipertensivos?",
                    "opciones": [
                        "A) Tomar con el estómago lleno",
                        "B) Evitar cambios bruscos de posición",
                        "C) Exponerse al sol sin protección",
                        "D) Hacer ejercicio intenso inmediatamente"
                    ],
                    "respuesta_correcta": 1,
                    "explicacion": "Los antihipertensivos pueden causar hipotensión ortostática, por lo que se debe evitar levantarse bruscamente."
                },
                {
                    "id": 3,
                    "pregunta": "¿Cuál es el valor normal de presión arterial para adultos?",
                    "opciones": [
                        "A) 140/90 mmHg",
                        "B) 120/80 mmHg",
                        "C) 160/100 mmHg", 
                        "D) 180/110 mmHg"
                    ],
                    "respuesta_correcta": 1,
                    "explicacion": "El valor normal de presión arterial es menor a 120/80 mmHg."
                },
                {
                    "id": 4,
                    "pregunta": "¿Qué efecto secundario es común en los inhibidores de la ECA?",
                    "opciones": [
                        "A) Tos seca",
                        "B) Diarrea",
                        "C) Insomnio",
                        "D) Pérdida de apetito"
                    ],
                    "respuesta_correcta": 0,
                    "explicacion": "La tos seca es un efecto secundario frecuente de los inhibidores de la ECA como el enalapril."
                }
            ]
        },
        {
            "id": 2,
            "titulo": "Caso Clínico: Gestión de Almacenamiento de Vacunas e Insulina",
            "descripcion": "Un auxiliar de farmacia recibe un nuevo lote de vacunas y jeringas precargadas de insulina. Estos productos requieren condiciones especiales de almacenamiento para mantener su calidad y eficacia.",
            "preguntas": [
                {
                    "id": 1,
                    "pregunta": "Considerando el vencimiento y la necesidad de cadena de frío, ¿cuál de las siguientes combinaciones de principio de gestión de existencias y rango de temperatura es la más adecuada para estos productos?",
                    "opciones": [
                        "A) FIFO (First In, First Out) a 15-25°C",
                        "B) LIFO (Last In, First Out) a 8-15°C", 
                        "C) FEFO (First Expired, First Out) a 2-8°C",
                        "D) FSN (Fast, Slow, Non-moving) a menos de 0°C"
                    ],
                    "respuesta_correcta": 2,
                    "explicacion": "La alternativa correcta es c) FEFO (First Expired, First Out) a 2-8°C. El principio FEFO, acrónimo en inglés de \"First Expired, First Out\", es fundamental para el auxiliar de farmacia y rige la norma 147. Este principio prioriza la salida de los productos cuya fecha de caducidad está más próxima, independientemente del lote, lo cual ayuda a prevenir pérdidas por vencimiento. Tanto las vacunas como las insulinas son productos que requieren mantener una cadena de frío estricta, lo que significa que deben conservarse a una temperatura entre 2 y 8°C. Es importante recordar que la insulina NUNCA debe ser congelada."
                }
            ]
        }
    ]
}

